IRP/src/Catalogs/Currencies/Currencies.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>Currencies</name>
 <predefined>
  <items>
   <name>Default</name>
  </items>
 </predefined>
 <attributes>
  <name>Symbol</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>3</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>NumericCode</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>3</length>
   </stringQualifiers>
  </type>
 </attributes>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/InformationRegisters/CurrencyRates/CurrencyRates.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
 <name>CurrencyRates</name>
 <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
 <resources>
  <name>Multiplicity</name>
  <type>
   <types>Number</types>
   <numberQualifiers>
    <precision>10</precision>
   </numberQualifiers>
  </type>
 </resources>
 <resources>
  <name>Rate</name>
  <type>
   <types>DefinedType.typeCurrencyRate</types>
  </type>
 </resources>
 <dimensions>
  <name>CurrencyFrom</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>CurrencyTo</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Source</name>
  <type>
   <types>CatalogRef.IntegrationSettings</types>
  </type>
 </dimensions>
</mdclass:InformationRegister>

IRP/src/Catalogs/Currencies/ManagerModule.bsl
Function GetCurrencyInfo(Period, CurrencyFrom, CurrencyTo, Source = Undefined) Export

	Result = New Structure("CurrencyFrom,
						   |CurrencyTo,
						   |Source,
						   |Rate,
						   |Multiplicity");

	If CurrencyFrom = CurrencyTo Then
		Result.CurrencyFrom = CurrencyFrom;
		Result.CurrencyTo = CurrencyTo;
		Result.Rate = 1;
		Result.Multiplicity = 1;
		Return Result;
	EndIf;

	Query = New Query();
	Query.Text =
	"SELECT
	|	ISNULL(CurrencyRatesSliceLast.CurrencyFrom, &CurrencyFrom) AS CurrencyFrom,
	|	ISNULL(CurrencyRatesSliceLast.CurrencyTo, &CurrencyTo) AS CurrencyTo,
	|	ISNULL(CurrencyRatesSliceLast.Source, &Source) AS Source,
	|	ISNULL(CurrencyRatesSliceLast.Multiplicity, 0) AS Multiplicity,
	|	ISNULL(CurrencyRatesSliceLast.Rate, 0) AS Rate
	|FROM
	|	InformationRegister.CurrencyRates.SliceLast(&Period, CurrencyFrom = &CurrencyFrom
	|	AND CurrencyTo = &CurrencyTo
	|	AND CASE
	|		WHEN &Source_Filter
	|			THEN Source = &Source
	|		ELSE TRUE
	|	END) AS CurrencyRatesSliceLast";

	Source_Filter = False;

	If ValueIsFilled(Source) Then
		Source_Filter = True;
	EndIf;
	Query.SetParameter("Period", Period);
	Query.SetParameter("CurrencyFrom", CurrencyFrom);
	Query.SetParameter("CurrencyTo", CurrencyTo);
	Query.SetParameter("Source_Filter", Source_Filter);
	Query.SetParameter("Source", Source);

	QueryResult = Query.Execute();
	QuerySelection = QueryResult.Select();
	If QuerySelection.Next() Then
		Result.CurrencyFrom = QuerySelection.CurrencyFrom;
		Result.CurrencyTo = QuerySelection.CurrencyTo;
		Result.Source = QuerySelection.Source;
		Result.Rate = QuerySelection.Rate;
		Result.Multiplicity = QuerySelection.Multiplicity;
	EndIf;

	Return Result;
EndFunction

// Get from basis document.
// 
// Parameters:
//  BasisDocument - DocumentRef
// 
// Returns:
//  Structure - Get from basis document:
// * CurrencyFrom - CatalogRef.Currencies
// * Rate - Number
// * ReverseRate - Number
// * ShowReverseRate - Boolean
// * Multiplicity - Number
Function GetFromBasisDocument(BasisDocument, CurrencyFrom, MovementType) Export

	Result = New Structure("CurrencyFrom,
						   |Rate,
						   |ReverseRate,
						   |ShowReverseRate,
						   |Multiplicity");

	If BasisDocument.Metadata().TabularSections.Find("Currencies") = Undefined Then
		Return Result;
	EndIf;	
	
	ValueTable = BasisDocument.Currencies.Unload( , "CurrencyFrom, Rate, ReverseRate, ShowReverseRate, Multiplicity, MovementType");
	SearchArray = ValueTable.FindRows(New Structure("CurrencyFrom, MovementType", CurrencyFrom, MovementType));
	
	If SearchArray.Count() > 0 Then
		FillPropertyValues(Result, SearchArray[0]);
	EndIf;
	Return Result;
	
EndFunction
